import React, { useState } from 'react';
import { useSpring, animated } from 'react-spring';

const Uslugi = ({ onClose }) => {
  // Дефинирайте стейт за видимостта на компонента
  const [visible, setVisible] = useState(true);

  // Използвайте useSpring за дефиниране на анимацията
  const uslugiAnimation = useSpring({
    opacity: visible ? 1 : 0, // Прозрачността зависи от видимостта
    transform: visible ? 'translateX(0)' : 'translateX(100%)', // Преместване на X ос при показване и скриване
  });

  // Функция за скриване на компонента
  const hideUslugi = () => {
    setVisible(false);
  };

  return (
    <animated.div style={uslugiAnimation} className="uslugi-container">
    <p>Отличният ни хотел предлага разнообразни услуги, за да направи вашето пребиваване незабравимо. Вижте какво предлагаме:</p>

<h3>Луксозни Стаи и Суити</h3>
<p>Съчетайте комфорта с елегантния дизайн на нашите луксозни стаи и суити. Всяка стая е обзаведена с внимание към детайла и предлага страхотен изглед към природата.</p>

<h3>Ресторант и Бар</h3>
<p>Насладете се на вкусната кухня в нашия ресторант, където талантливите готвачи приготвят изискани ястия от прясни продукти. Барът ни предлага разнообразни напитки и коктейли.</p>

<h3>СПА и Уелнес Център</h3>
<p>Разслабете се и се поддайте на удоволствието на нашия СПА и Уелнес център. Предлагаме различни терапии, масажи и процедури, които ще ви освежат и възстановят.</p>

<h3>Басейн и Спортни Активности</h3>
<p>Отпуснете се край басейна или се занимавайте с различни спортни активности в нашите съоръжения. Има нещо за всеки, който обича активния начин на живот.</p>

<h3>Конферентни Зали</h3>
<p>Планирайте успешни бизнес срещи и конференции в нашите модерни конферентни зали. Предоставяме всичко необходимо за вашия корпоративен успех.</p>

<p>Това са само някои от предлаганите от нас услуги. За повече информация, не се колебайте да се свържете с нас или да посетите рецепцията по време на вашето престой.</p>
      <button onClick={() => { onClose(); hideUslugi(); }}>Затвори</button>
    </animated.div>
  );
};

export default Uslugi;